# 30 - Akses nilai variabel dalam fungsi query

# Import Modules

In [1]:
import pandas as pd 
import numpy as np

print(pd.__version__)
print(np.__version__)

1.2.4
1.20.1

# Persiapan data frame

-Data Frame ini tersedia dari 5 buah baris dan 5 buah kolom

-memiliki label ABCDE 

-dengan isi nya merupakan angka yang telah di random oleh fungsi random.randint dengan range 1 sampai 20

In [2]:
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1,20,size=(n_rows,n_cols)),
                  columns=cols)
df

    A   B   C   D   E
0  11   4   5  13   5
1   9  10  18   9   1
2  11  12  16   8   7
3  18  11  14  19  18
4  16  16  13   2   5

# Akses nilai variabel pada query()

-Pertama menyeleksi baris A > 5 

-kedua menghitung nilai rata rata dari kolom A

-ketiga menyeleksi nilai A > rata rata

In [3]:
df.query('A>5')

    A   B   C   D   E
0  11   4   5  13   5
1   9  10  18   9   1
2  11  12  16   8   7
3  18  11  14  19  18
4  16  16  13   2   5

In [4]:
rerata = df['A'].mean()
rerata

13.0

In [5]:
df.query('A>@rerata')

    A   B   C   D   E
3  18  11  14  19  18
4  16  16  13   2   5